---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.#ctor
source: html/6ed39f76-7f51-90d6-7d47-b7292da6f8e3.htm
---
# Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.#ctor Method

Constructs a new instance of the options.

## Syntax (C#)
```csharp
public SystemsAnalysisOptions()
```